Hello,Ciao
Bye,Ciao
Alright,Va bene
Cool,Figo
Thing,Cosa
Now,Adesso
Today,Oggi
Tired,Stanco/a
I,Io
You,Tu
He,Lui
She,Lei
This,Questo/a
Here,Qui
There,Lì/Là
Yes,Sì
No,No
Please,Per favore
Thank you,Grazie
Sorry,Scusa/Mi dispiace
Great,Fantastico
Bad,Cattivo/Brutto
Beautiful,Bello/a
Ugly,Brutto/a
Good,Buono/a
Hungry,Affamato/a
Help,Aiuto
Why,Perché
Where,Dove
When,Quando
How,Come
Who,Chi
What,Che cosa / Cosa
Which,Quale
Friend,Amico/a
Love,Amore
Happy,Felice
Sad,Triste
Angry,Arrabbiato/a
Scared,Spaventato/a
Excited,Eccitato/a
Bored,Annoiato/a
Confused,Confuso/a
Hot,Caldo/a
Cold,Freddo/a
Drink,Bere/Bevi
Eat,Mangiare/Mangia
Sleep,Dormire/Dormi
Walk,Camminare/Cammina
Run,Correre/Corri
Talk,Parlare/Parla
Listen,Ascoltare/Ascolta
See,Vedere/Vedi
Hear,Sentire/Senti
Smell,Odorare/Odora
Taste,Assaggiare/Assaggia
Touch,Toccare/Tocca
Think,Pensare/Pensa
Know,Sapere/Sai
Understand,Capire/Capisci
Learn,Imparare/Impara
Teach,Insegnare/Insegna
Read,Leggere/Leggi
Write,Scrivere/Scrivi
Sing,Cantare/Canta
Dance,Ballare/Balla
Play,Giocare/Gioca
Work,Lavorare/Lavora
Study,Studiare/Studia
Travel,Viaggiare/Viaggia
Live,Vivere/Vivi
Die,Morire/Muori
Dream,Sognare/Sogna
Believe,Credere/Credi
Hope,Sperare/Spera
Wish,Desiderare/Desideri
Need,Aver bisogno di
Want,Volere/Vuoi
Have,Avere/Hai
Like,Piacere/Piace
Dislike,Non piacere/Non piace
Enjoy,Godere/Godi
Hate,Odiare/Odi
It,Quello/a
That,Quello/a
Morning,Mattina
Afternoon,Pomeriggio
Evening,Sera
Night,Notte
Sun,Sole
Moon,Luna
Star,Stella
Sky,Cielo
Cloud,Nuvola
Rain,Pioggia
Snow,Neve
Wind,Vento
Fire,Fuoco
Water,Acqua
Earth,Terra
Mountain,Montagna
River,Fiume
Lake,Lago
Sea,Mare
Tree,Albero
Flower,Fiore
Animal,Animale
Dog,Cane
Cat,Gatto
Bird,Uccello
Fish,Pesce
House,Casa
Room,Stanza
Door,Porta
Window,Finestra
Chair,Sedia
Table,Tavolo
Bed,Letto
Food,Cibo
Bread,Pane
Fruit,Frutta
Vegetable,Verdura
Meat,Carne
Cheese,Formaggio
Wine,Vino
Beer,Birra
Coffee,Caffè
Tea,Tè
Music,Musica
Book,Libro
Movie,Film
Game,Gioco
Sport,Sport
Car,Macchina
Bus,Autobus
Train,Treno
Plane,Aereo
Boat,Barca
Bicycle,Bicicletta
Computer,Computer
Phone,Telefono
Money,Soldi
Time,Tempo
Year,Anno
Month,Mese
Week,Settimana
Day,Giorno
Hour,Ora
Minute,Minuto
Second,Secondo
Big,Grande
Small,Piccolo/a
Old,Vecchio/a
New,Nuovo/a
Young,Giovane
Fast,Veloce
Slow,Lento/a
Easy,Facile
Difficult,Difficile
Expensive,Costoso/a
Cheap,Economico/a
Clean,Pulito/a
Dirty,Sporco/a
Open,Aperto/a
Closed,Chiuso/a
Empty,Vuoto/a
Full,Pieno/a
Heavy,Pesante
Light,Leggero/a
Strong,Forte
Weak,Debole
Sick,Malato/a
Healthy,Sano/a
Right,Giusto/a
Wrong,Sbagliato/a
Early,Presto
Late,Tardi
Inside,Dentro
Outside,Fuori
Above,Sopra
Below,Sotto
Near,Vicino/a
Far,Lontano/a
Before,Prima
After,Dopo
Left,Sinistra
Right,Destra
Front,Davanti
Back,Dietro
Up,Su
Down,Giù
Start,Iniziare/Inizia
Finish,Finire/Finisci
Wait,Aspettare/Aspetta
Stop,Fermare/Ferma
Continue,Continuare/Continua
Go,Andare/Vai
Come,Venire/Vieni
Bring,Portare/Porta
Take,Prendere/Prendi
Give,Dare/Dai
Receive,Ricevere/Ricevi
Buy,Comprare/Compra
Sell,Vendere/Vendi
Pay,Pagare/Paga
Win,Vincere/Vinci
Lose,Perdere/Perdi
Find,Trovare/Trova
Search,Cercare/Cerca
Meet,Incontrare/Incontra
Follow,Seguire/Segui
Lead,Guidare/Guida
Answer,Rispondere/Rispondi
Ask,Chiedere/Chiedi
Tell,Dire/Di
Show,Mostrare/Mostra
Hide,Nascondere/Nascondi
Laugh,Ridere/Ridi
Cry,Piangere/Piangi
Smile,Sorridere/Sorridi
Kiss,Baciare/Bacia
Hug,Abbracciare/Abbraccia
Marry,Sposare/Sposa
Birthday,Compleanno
Party,Festa
Holiday,Vacanza
Trip,Viaggio
Hotel,Hotel
Restaurant,Ristorante
Bar,Bar
Shop,Negozio
Market,Mercato
Museum,Museo
Church,Chiesa
School,Scuola
University,Università
Hospital,Ospedale
Police,Polizia
Doctor,Dottore/Dottoressa
Nurse,Infermiere/a
Family,Famiglia
Mother,Madre
Father,Padre
Sister,Sorella
Brother,Fratello
Husband,Marito
Wife,Moglie
Son,Figlio
Daughter,Figlia
Child,Bambino/a
Baby,Neonato/a
Person,Persona
Man,Uomo
Woman,Donna
Boy,Ragazzo
Girl,Ragazza
Quickly,Velocemente
Slowly,Lentamente
Easily,Facilmente
Hard,Difficilmente
Always,Sempre
Never,Mai
Sometimes,A volte
Often,Spesso
Rarely,Raramente
Usually,Di solito
Really,Davvero
Actually,In realtà
Maybe,Forse
Perhaps,Magari
Probably,Probabilmente
Definitely,Sicuramente
Absolutely,Assolutamente
Exactly,Esattamente
Clearly,Chiaramente
Obviously,Ovviamente
Honestly,Onestamente
Seriously,Seriamente
Fortunately,Fortunatamente
Unfortunately,Sfortunatamente
Suddenly,Improvvisamente
Finally,Finalmente
Immediately,Immediatamente
Especially,Soprattutto
Instead,Invece
Almost,Quasi
Enough,Abbastanza
Too much,Troppo
Too little,Troppo poco
Very,Molto
So,Così
Pretty,Abbastanza
Quite,Piuttosto
Rather,Piuttosto
Fairly,Abbastanza
Kind of,Un po'
Sort of,Tipo
A bit,Un po'
A little,Un po'
A lot,Molto
Many,Molti/e
Few,Pochi/e
Some,Alcuni/e
Any,Qualche/Qualsiasi
None,Nessuno/a
All,Tutti/e
Every,Ogni
Each,Ciascuno/a
Both,Entrambi/e
Either,O
Neither,Né
One,Uno/a
Two,Due
Three,Tre
Four,Quattro
Five,Cinque
Six,Sei
Seven,Sette
Eight,Otto
Nine,Nove
Ten,Dieci
Zero,Zero
First,Primo/a
Second,Secondo/a
Third,Terzo/a
Last,Ultimo/a
Next,Prossimo/a
Previous,Precedente
Better,Migliore
Worse,Peggiore
Best,Il/La migliore
Worst,Il/La peggiore
More,Più
Less,Meno
Most,La maggior parte
Least,La minor parte
Same,Stesso/a
Different,Diverso/a
Equal,Uguale
Similar,Simile
Opposite,Opposto/a
To be,Essere
I am,Io sono
You are,Tu sei
He/She/It is,Lui/Lei/Esso è
We are,Noi siamo
You are,Voi siete
They are,Loro sono
To have,Avere
I have,Io ho
You have,Tu hai
He/She/It has,Lui/Lei/Esso ha
We have,Noi abbiamo
You have,Voi avete
They have,Loro hanno