Hi,Ciao
Hello,Ciao
Alone,Solo
Alright,Va bene
Cool,Figo
Thing,Cosa
Now,Adesso
Today,Oggi
Tired,Stanco
I,Io
You,Tu
He,Lui
She,Lei
This,Questo
Here,Qui
There,Lì
Yes,Sì
Don't,No
No,No
And,E
Please,Per favore
Thanks,Grazie
Sorry,Scusa
Great,Fantastico
Bad,Cattivo
Beautiful,Bello
Ugly,Brutto
Good,Buono
Again,Nuovamente
Hungry,Affamato
Help,Aiuto
Why,Perché
Where,Dove
When,Quando
How,Come
Who,Chi
What,Cosa
Which,Quale
Friend,Amico
Love,Amore
Happy,Felice
Sad,Triste
Angry,Arrabbiato
Scared,Spaventato
Excited,Eccitato
Bored,Annoiato
Confused,Confuso
Hot,Caldo
Cold,Freddo
Drink,Bere
Eat,Mangiare
Sleep,Dormire
Walk,Camminare
Run,Correre
Talk,Parlare
Listen,Ascoltare
See,Vedere
Hear,Sentire
Smell,Odorare
Taste,Assaggiare
Touch,Toccare
Think,Pensare
Know,Sapere
Understand,Capire
Learn,Imparare
Teach,Insegnare
Read,Leggere
Write,Scrivere
Sing,Cantare
Dance,Ballare
Play,Giocare
Work,Lavorare
Study,Studiare
Travel,Viaggiare
Live,Vivere
Die,Morire
Dream,Sognare
Believe,Credere
Hope,Sperare
Wish,Desiderare
Need,Bisogno
Want,Volere
Have,Avere
Like,Piacere
Dislike,Non piacere/Non piace
Enjoy,Godere
Hate,Odiare
It,Quello
That,Quello
Morning,Mattina
Afternoon,Pomeriggio
Evening,Sera
Night,Notte
Sun,Sole
Moon,Luna
Star,Stella
Sky,Cielo
Cloud,Nuvola
Rain,Pioggia
Snow,Neve
Wind,Vento
Fire,Fuoco
Water,Acqua
Earth,Terra
Mountain,Montagna
River,Fiume
Lake,Lago
Sea,Mare
Tree,Albero
Flower,Fiore
Animal,Animale
Dog,Cane
Cat,Gatto
Bird,Uccello
Fish,Pesce
House,Casa
Room,Stanza
Door,Porta
Window,Finestra
Chair,Sedia
Table,Tavolo
Bed,Letto
Food,Cibo
Bread,Pane
Fruit,Frutta
Vegetable,Verdura
Meat,Carne
Cheese,Formaggio
Wine,Vino
Beer,Birra
Coffee,Caffe
Tea,Te
Music,Musica
Book,Libro
Movie,Film
Game,Gioco
Sport,Sport
Car,Macchina
Bus,Autobus
Train,Treno
Plane,Aereo
Boat,Barca
Bicycle,Bicicletta
Computer,Computer
Phone,Telefono
Money,Soldi
Time,Tempo
Year,Anno
Month,Mese
Week,Settimana
Day,Giorno
Hour,Ora
Minute,Minuto
Second,Secondo
Big,Grande
Small,Piccolo
Old,Vecchio
New,Nuovo
Young,Giovane
Fast,Veloce
Slow,Lento
Easy,Facile
Difficult,Difficile
Expensive,Costoso
Cheap,Economico
Clean,Pulito
Dirty,Sporco
Open,Aperto
Closed,Chiuso
Empty,Vuoto
Full,Pieno
Heavy,Pesante
Light,Leggero
Strong,Forte
Weak,Debole
Sick,Malato
Healthy,Sano
Right,Giusto
Wrong,Sbagliato
Early,Presto
Late,Tardi
Inside,Dentro
Outside,Fuori
Above,Sopra
Below,Sotto
Near,Vicino
Far,Lontano
Before,Prima
After,Dopo
Left,Sinistra
Right,Destra
Front,Davanti
Back,Dietro
Up,Su
Down,Giù
Start,Iniziare
Finish,Finire
Wait,Aspettare
Stop,Fermare
Continue,Continuare
Go,Andare
Come,Venire
Bring,Portare
Take,Prendere
Give,Dare
Receive,Ricevere
Buy,Comprare
Sell,Vendere
Pay,Pagare
Win,Vincere
Lose,Perdere
Find,Trovare
Search,Cercare
Meet,Incontrare
Follow,Seguire
Lead,Guidare
Answer,Rispondere
Ask,Chiedere
Tell,Dire
Show,Mostrare
Hide,Nascondere
Laugh,Ridere
Cry,Piangere
Smile,Sorridere
Kiss,Baciare
Hug,Abbracciare
Marry,Sposare
Birthday,Compleanno
Party,Festa
Holiday,Vacanza
Trip,Viaggio
Hotel,Hotel
Restaurant,Ristorante
Bar,Bar
Shop,Negozio
Market,Mercato
Museum,Museo
Church,Chiesa
School,Scuola
University,Università
Hospital,Ospedale
Police,Polizia
Doctor,Dottore
Nurse,Infermiere
Family,Famiglia
Mother,Madre
Father,Padre
Sister,Sorella
Brother,Fratello
Husband,Marito
Wife,Moglie
Son,Figlio
Daughter,Figlia
Child,Bambino
Baby,Neonato
Person,Persona
Man,Uomo
Woman,Donna
Boy,Ragazzo
Girl,Ragazza
Quickly,Velocemente
Slowly,Lentamente
Easily,Facilmente
Hard,Difficilmente
Always,Sempre
Never,Mai
Sometimes,A volte
Often,Spesso
Rarely,Raramente
Usually,Di solito
Really,Davvero
Actually,In realtà
Maybe,Forse
Perhaps,Magari
Probably,Probabilmente
Definitely,Sicuramente
Absolutely,Assolutamente
Exactly,Esattamente
Clearly,Chiaramente
Obviously,Ovviamente
Honestly,Onestamente
Seriously,Seriamente
Fortunately,Fortunatamente
Unfortunately,Sfortunatamente
Suddenly,Improvvisamente
Finally,Finalmente
Immediately,Immediatamente
Especially,Soprattutto
Instead,Invece
Almost,Quasi
Enough,Abbastanza
Much,Troppo
Little,Troppo poco
Very,Molto
So,Così
Pretty,Abbastanza
Quite,Piuttosto
Rather,Piuttosto
Fairly,Abbastanza
Bit,Poco
Little,Poco
Lot,Molto
Many,Molti
Few,Pochi
Some,Alcuni
Any,Qualche
None,Nessuno
All,Tutti
Every,Ogni
Each,Ciascuno
Both,Entrambi
Either,O
Neither,Ne
First,Primo
Second,Secondo
Third,Terzo
Last,Ultimo
Next,Prossimo
Previous,Precedente
Better,Migliore
Worse,Peggiore
Best,Il migliore
Worst,Il peggiore
More,Piu
Less,Meno
Most,La maggior parte
Least,La minor parte
Same,Stesso
Different,Diverso
Equal,Uguale
Similar,Simile
Opposite,Opposto
be,Essere
Am,Sono
Are,Stare
Have,Avere
Has,Ha
Foot,Piede
Feet,Piedi
